       01 Employee-Record.
          05 Employee-ID PIC 9(5).
          05 Employee-Name PIC X(30) value "John Doe".
          05 Employee-Salary PIC 9(7)V99.
       