       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY Employee-Record.
       
       PROCEDURE DIVISION.
           DISPLAY "Employee Name: " Employee-Name.
           STOP RUN.
